Yr8/8-CS-TextGames/source/4_Lesson.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js" type="text/javascript"></script>
#+HTML_HEAD_EXTRA: <script src="js/navbar.js" type="text/javascript"></script>
#+OPTIONS: f:nil author:nil num:1 creator:nil timestamp:nil toc:nil

#+TITLE: Text Based Games
#+AUTHOR: Marc Scott

#+BEGIN_HTML
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-CS-TextGames">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* Hangman
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

- In this lesson you're going to create a version of hangman, that you can play against the computer.
- Let's have a little look at the logic of the game.
  1. The word should be displayed with =_= in place of each letter.
  2. The player should guess a letter.
  3. If the letter is in a list of all letters, the letter should be removed from the list.
  4. If the letter is in the word, then the =_= should be replaced with the letter, and we should store how many correct letters the player has guessed (This takes into account repeats).
  5. If the letter is not in the word, then the gallows can begin to be drawn.
  6. The player should be asked for another letter.
  7. The game ends when the player has made correct guesses that equal the length of the word, or the last stage of the gallows has been drawn.
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- The first step will be fairly simple.
- We need to use ASCII characters to create the graphic that is displayed on the screen.
- We'll assign variables to have the values of the graphic.
- The first couple have been done for you in the code below.
- In python we use ='''= to print multi-line strings.
#+begin_src python
stage0=''
stage1 = '''
_______________'''
stage2 = '''
|
|
|
|
|
|
|\______________'''
stage3 = '''
__________
|/
|
|
|
|
|
|\______________'''
#+end_src
** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:
- Use ASCII to create the rest of the stages. The number of stages you have is obviously up to you.
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Now that you have all the stages of the hangman graphic, we need a way of easily printing out a specific stage as the game progresses.
- Probably the best way of doing this is to use a list.
  #+begin_src python
stage = [stage0,stage1,stage2,stage3,stage4,stage5,stage6,stage7,stage8]
  #+end_src
- obviously this will need altering depending on the number of stages you have in your game.
** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:
- Let's try printing out some stages from your game.
- Save you file as =Hangman.py= and then run it.
- Switch over to the =interpreter= and then try accessing various stages of your graphic in the following way.
#+begin_src python
print(stage[4])
#+end_src
- Remember, lists are indexed from 0.
- Make sure that each of your stages print out correctly.
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Let's add in a couple of variables that will probably be important.
- We'll want to store which stage of the gallows the player has currently reached.
- We'll also want to know how many correct letters the player has guessed.
#+begin_src python
stageindex = 0
correctLetters = 0
#+end_src
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- We'll want to a way of storing the guesses the player has made, and ensuring that only letters are accepted.
- The easiest way to do this is with a data structure that stores all the letters of the alphabet.
- Let's start with a simple string.
#+begin_src python
alphabet = 'abcdefghijklmnopqrstuvwxyz'
#+end_src
- The problem with a string is that it's not easy to remove elements from it.
- It would be much easier to have all the letters in a list, but that would mean a lot more typing.
- It would be better if we could use a little loop, to create a list for us.
#+begin_src python
  alphalist = []
  for letter in alphabet:
      alphalist.append(letter)
#+end_src
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
- The code above is a perfectly sensible way of creating a list of all the letters in the alphabet, but it is a little verbose.
- Luckily there is an easier way of creating lists in Python called =List Comprehensions=.
- In the next exercise, you're going to use list comprehensions to create some lists.
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- The easiest way of learning about list comprehensions is to write some.
#+begin_src python
numbersto10 = [number for number in range(10)]
#+end_src
- We start by naming our list.
- In the square brackets is the list comprehension.
- This one says.
  - Fill the list with =number=
  - Where =number= is each element of =range(10)=
- Let's have a look at another one.
#+begin_src python
foo = 'Hello World!'
bar = [character for character in foo]
#+end_src
- Here we create a list containing all the characters that are in foo.
