Yr8/8-CS-TextGames/pages/4_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Text Based Games</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Text Based Games</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-CS-TextGames">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Hangman</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">

<ul class="org-ul">
<li>In this lesson you're going to create a version of hangman, that you can play against the computer.
</li>
<li>Let's have a little look at the logic of the game.
<ol class="org-ol">
<li>The word should be displayed with <code>_</code> in place of each letter.
</li>
<li>The player should guess a letter.
</li>
<li>If the letter is in a list of all letters, the letter should be removed from the list.
</li>
<li>If the letter is in the word, then the <code>_</code> should be replaced with the letter, and we should store how many correct guesses the player has had.
</li>
<li>If the letter is not in the word, then the gallows can begin to be drawn.
</li>
<li>The player should be asked for another letter.
</li>
<li>The game ends when the player has made correct guesses that equal the length of the word, or the last stage of the gallows has been drawn.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 code">
<h3 id="sec-1-2">Code It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>The first step will be fairly simple.
</li>
<li>We need to use ASCII characters to create the graphic that is displayed on the screen.
</li>
<li>We'll assign variables to have the values of the graphic.
</li>
<li>The first couple have been done for you in the code below.
</li>
<li>In python we use ='''= to print multi-line strings.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">stage0</span>=<span style="color: #2aa198;">''</span>
<span style="color: #6c71c4;">stage1</span> = <span style="color: #2aa198;">'''</span>
<span style="color: #2aa198;">_______________'''</span>
<span style="color: #6c71c4;">stage2</span> = <span style="color: #2aa198;">'''</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|\______________'''</span>
<span style="color: #6c71c4;">stage3</span> = <span style="color: #2aa198;">'''</span>
<span style="color: #2aa198;">__________</span>
<span style="color: #2aa198;">|/</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|</span>
<span style="color: #2aa198;">|\______________'''</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 try">
<h3 id="sec-1-3">Try It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Use ASCII to create the rest of the stages. The number of stages you have is obviously up to you.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 code">
<h3 id="sec-1-4">Code It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Now that you have all the stages of the hangman graphic, we need a way of easily printing out a specific stage as the game progresses.
</li>
<li>Probably the best way of doing this is to use a list.
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">stage</span> = [stage0,stage1,stage2,stage3,stage4,stage5,stage6,stage7,stage8]
</pre>
</div>
</li>
<li>obviously this will need altering depending on the number of stages you have in your game.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 try">
<h3 id="sec-1-5">Try It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Let's try printing out some stages from your game.
</li>
<li>Save you file as <code>Hangman.py</code> and then run it.
</li>
<li>Switch over to the <code>interpreter</code> and then try accessing various stages of your graphic in the following way.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">print</span>(stage[4])
</pre>
</div>
<ul class="org-ul">
<li>Remember, lists are indexed from 0.
</li>
<li>Make sure that each of your stages print out correctly.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 code">
<h3 id="sec-1-6">Code It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Let's add in a couple of variables that will probably be important.
</li>
<li>We'll want to store which stage of the gallows the player has currently reached.
</li>
<li>We'll also want to know how many correct guesses the player has made.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">stageindex</span> = 0
<span style="color: #6c71c4;">correctGuesses</span> = 0
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 code">
<h3 id="sec-1-7">Code It</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>We'll want to a way of storing the guesses the player has made, and ensuring that only letters are accepted.
</li>
<li>The easiest way to do this is with a data structure that stores all the letters of the alphabet.
</li>
<li>Let's start with a simple string.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">alphabet</span> = <span style="color: #2aa198;">'abcdefghijklmnopqrstuvwxyz'</span>
</pre>
</div>
<ul class="org-ul">
<li>The problem with a string is that it's not easy to remove elements from it.
</li>
<li>It would be much easier to have all the letters in a list, but that would mean a lot more typing.
</li>
<li>It would be better if we could use a little loop, to create a list for us.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">alphalist</span> = []
<span style="color: #859900;">for</span> letter <span style="color: #859900;">in</span> alphabet:
    alphalist.append(letter)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 learn">
<h3 id="sec-1-8">Learn It</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>The code above is a perfectly sensible way of creating a list of all the letters in the alphabet, but it is a little verbose.
</li>
<li>Luckily there is an easier way of creating lists in Python called <code>List Comprehensions</code>.
</li>
<li>In the next exercise, you're going to use list comprehensions to create some lists.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3 code">
<h3 id="sec-1-9">Code It</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>The easiest way of learning about list comprehensions is to write some.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">numbersto10</span> = [number <span style="color: #859900;">for</span> number <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(10)]
</pre>
</div>
<ul class="org-ul">
<li>We start by naming our list.
</li>
<li>In the square brackets is the list comprehension.
</li>
<li>This one says.
<ul class="org-ul">
<li>Fill the list with <code>number</code>
</li>
<li>Where <code>number</code> is each element of <code>range(10)</code>
</li>
</ul>
</li>
<li>Let's have a look at another one.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'Hello World!'</span>
<span style="color: #6c71c4;">bar</span> = [character <span style="color: #859900;">for</span> character <span style="color: #859900;">in</span> foo]
</pre>
</div>
<ul class="org-ul">
<li>Here we create a list containing all the characters that are in foo.
</li>
</ul>
</div>
</div>
