Yr8/8-CS-TextGames/source/4_Lesson.org
** Badge It - Silver
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- Create a new file called ListComps.py
- Work out what each of these list comprehensions achieves. Don't worry if you don't understand them all fully. The first few should be okay, but the later ones are just to show you how powerful list comprehensions can be.
#+begin_src python
List1 = [i for i in range(20,10,-1)]
#+end_src
#+begin_src python
List2 = [j**2 for j in range(10)]
#+end_src
#+begin_src python
List3 = [k for k in range(100) if k % 2 == 0]
#+end_src
#+begin_src python
List4 = [l.lower() for l in 'ABCDEFG']
#+end_src
#+begin_src python
List5 = ['_' for m in 'Hello World!']
#+end_src
#+begin_src python
List6 = [n for n in 'The Quick Brown Fox' if n.upper() == n and n != ' ']
#+end_src
#+begin_src python
List7 = [word[0] for word in 'my race should continue on to the island 
shore to help ease boring eye strain tonight'.split()]
#+end_src
#+begin_src python
List8 = [[row[i] for row in [[1,2,3],[4,5,6],[7,8,9]]]for i in range(3)]
#+end_src
** Badge It - Gold  (Part I)
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- Use list comprehensions to create the following lists.
  1. [-10,-9,-8,-7,-6,-5,-4,-3,-2,-1,0]
  2. A list of all consonants in the sentence 'The quick brown fox jumped over the lazy dog'
  3. A list of all square numbers formed by squaring the numbers from 1 to 1000.
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Let's switch back to our =hangman.py= file now and create our list of letters in the alphabet now.
#+begin_src python
alphabet = 'qwertyuiopasdfghjklzxcvbnm'
alphalist = [letter for letter in alphabet]
#+end_src
- We'll also need a list of words that the user is going to have to guess letters for.
#+begin_src python
words = ['computer','science','internet','www','onedirection']
#+end_src
- Feel free to add your own words.
- Next we'll want to get the computer to choose a word at random from the list. You've used the random module before.
- Add the line
#+begin_src python
import random
#+end_src
- to the very top of your python file.
- then after the =words= list we can add the line
#+begin_src python
word = random.choice(words)
#+end_src
- This will pick a random word from the words list for use with the game.
- Last of all, before we start on the actual game logic, we'll set a variable to state that the game is running.
#+begin_src python
gameOn = True
#+end_src
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
- Because the hangman game is a little more complicated than before, we're going to break it up into functions.
- Functions are blocks of code that perform a ... function.
- In Python we create a function using the keyword =def=
#+begin_src python
def foo():
    some code...
#+end_src
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- Let's start by creating a function to print out the word that the user is guessing. If a letter has been guessed, then it should be displayed, otherwise we should display an =_=.
- We'll start by giving the function a name.
#+begin_src python
def displayWord():
#+end_src
- Code inside a function, needs to be indented.
- Let's print an empty line to start with.
#+begin_src python
  def displayWord():
      print('')
#+end_src
** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:
- Now you need to create the rest of the code in the function.
- Have a go and get your teacher to check if you're not sure.
- Here is the logic.
  1. Declare a variable called =display= and assign it the value of an empty string =''=
  2. For every letter in the word.
  3. If the letter is not in the alphalist (which currently contains all the letters not guessed) then add the letter to display along with a space (=' '=)
  4. Else display ='_ '=
  5. Print the display variable.
** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:
- Let's try testing the code.
- Run your program and then switch into the interpreter.
- Let's cheat a little and set word to a known value.
#+begin_src python
word = 'hello'
#+end_src
- Now let's run the function
#+begin_src language
displayWord()
#+end_src
- You should see 5 =_= characters printed.
- We can remove some letters from the =alphalist= to simulate guesses.
#+begin_src python
alphalist.remove('l')
displayWord()
#+end_src
- You should see =_ _ l l _= printed.
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- The next function is easy.
- We need to print out the current stage.
#+begin_src python
  def displayStage():
      print(stages[stageindex])
#+end_src
