Yr8/8-CS-TextGames/pages/4_Lesson.html
<div id="outline-container-sec-1-10" class="outline-3 badge">
<h3 id="sec-1-10">Badge It - Silver</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Create a new file called ListComps.py
</li>
<li>Work out what each of these list comprehensions achieves. Don't worry if you don't understand them all fully. The first few should be okay, but the later ones are just to show you how powerful list comprehensions can be.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List1</span> = [i <span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(20,10,-1)]
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List2</span> = [j**2 <span style="color: #859900;">for</span> j <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(10)]
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List3</span> = [k <span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(100) <span style="color: #859900;">if</span> k % 2 == 0]
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List4</span> = [l.lower() <span style="color: #859900;">for</span> l <span style="color: #859900;">in</span> <span style="color: #2aa198;">'ABCDEFG'</span>]
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List5</span> = [<span style="color: #2aa198;">'_'</span> <span style="color: #859900;">for</span> m <span style="color: #859900;">in</span> <span style="color: #2aa198;">'Hello World!'</span>]
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List6</span> = [n <span style="color: #859900;">for</span> n <span style="color: #859900;">in</span> <span style="color: #2aa198;">'The Quick Brown Fox'</span> <span style="color: #859900;">if</span> n.upper() == n <span style="color: #859900;">and</span> n != <span style="color: #2aa198;">' '</span>]
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List7</span> = [word[0] <span style="color: #859900;">for</span> word <span style="color: #859900;">in</span> <span style="color: #2aa198;">'my race should continue on to the island </span>
<span style="color: #2aa198;">shore to help ease boring eye strain tonight'</span>.split()]
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">List8</span> = [[row[i] <span style="color: #859900;">for</span> row <span style="color: #859900;">in</span> [[1,2,3],[4,5,6],[7,8,9]]]<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(3)]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3 badge">
<h3 id="sec-1-11">Badge It - Gold  (Part I)</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Use list comprehensions to create the following lists.
<ol class="org-ol">
<li>[-10,-9,-8,-7,-6,-5,-4,-3,-2,-1,0]
</li>
<li>A list of all consonants in the sentence 'The quick brown fox jumped over the lazy dog'
</li>
<li>A list of all square numbers formed by squaring the numbers from 1 to 1000.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-12" class="outline-3 code">
<h3 id="sec-1-12">Code It</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>Let's switch back to our <code>hangman.py</code> file now and create our list of letters in the alphabet now.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">alphabet</span> = <span style="color: #2aa198;">'qwertyuiopasdfghjklzxcvbnm'</span>
<span style="color: #6c71c4;">alphalist</span> = [letter <span style="color: #859900;">for</span> letter <span style="color: #859900;">in</span> alphabet]
</pre>
</div>
<ul class="org-ul">
<li>We'll also need a list of words that the user is going to have to guess letters for.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">words</span> = [<span style="color: #2aa198;">'computer'</span>,<span style="color: #2aa198;">'science'</span>,<span style="color: #2aa198;">'internet'</span>,<span style="color: #2aa198;">'www'</span>,<span style="color: #2aa198;">'onedirection'</span>]
</pre>
</div>
<ul class="org-ul">
<li>Feel free to add your own words.
</li>
<li>Next we'll want to get the computer to choose a word at random from the list. You've used the random module before.
</li>
<li>Add the line
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">import</span> random
</pre>
</div>
<ul class="org-ul">
<li>to the very top of your python file.
</li>
<li>then after the <code>words</code> list we can add the line
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">word</span> = random.choice(words)
</pre>
</div>
<ul class="org-ul">
<li>This will pick a random word from the words list for use with the game.
</li>
<li>Last of all, before we start on the actual game logic, we'll set a variable to state that the game is running.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">gameOn</span> = <span style="color: #268bd2;">True</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-13" class="outline-3 learn">
<h3 id="sec-1-13">Learn It</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>Because the hangman game is a little more complicated than before, we're going to break it up into functions.
</li>
<li>Functions are blocks of code that perform a &#x2026; function.
</li>
<li>In Python we create a function using the keyword <code>def</code>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">foo</span>():
    some code...
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-14" class="outline-3 code">
<h3 id="sec-1-14">Code It</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>Let's start by creating a function to print out the word that the user is guessing. If a letter has been guessed, then it should be displayed, otherwise we should display an <code>_</code>.
</li>
<li>We'll start by giving the function a name.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">displayWord</span>():
</pre>
</div>
<ul class="org-ul">
<li>Code inside a function, needs to be indented.
</li>
<li>Let's print an empty line to start with.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">displayWord</span>():
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">''</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-15" class="outline-3 try">
<h3 id="sec-1-15">Try It</h3>
<div class="outline-text-3" id="text-1-15">
<ul class="org-ul">
<li>Now you need to create the rest of the code in the function.
</li>
<li>Have a go and get your teacher to check if you're not sure.
</li>
<li>Here is the logic.
<ol class="org-ol">
<li>Declare a variable called <code>display</code> and assign it the value of an empty string =''=
</li>
<li>For every letter in the word.
</li>
<li>If the letter is not in the alphalist (which currently contains all the letters not guessed) then add the letter to display along with a space (=' '=)
</li>
<li>Else display ='_ '=
</li>
<li>Print the display variable.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-16" class="outline-3 test">
<h3 id="sec-1-16">Test It</h3>
<div class="outline-text-3" id="text-1-16">
<ul class="org-ul">
<li>Let's try testing the code.
</li>
<li>Run your program and then switch into the interpreter.
</li>
<li>Let's cheat a little and set word to a known value.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">word</span> = <span style="color: #2aa198;">'hello'</span>
</pre>
</div>
<ul class="org-ul">
<li>Now let's run the function
</li>
</ul>
<div class="org-src-container">

<pre class="src src-language">displayWord()
</pre>
</div>
<ul class="org-ul">
<li>You should see 5 <code>_</code> characters printed.
</li>
<li>We can remove some letters from the <code>alphalist</code> to simulate guesses.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">alphalist.remove(<span style="color: #2aa198;">'l'</span>)
displayWord()
</pre>
</div>
<ul class="org-ul">
<li>You should see <code>_ _ l l _</code> printed.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-17" class="outline-3 code">
<h3 id="sec-1-17">Code It</h3>
<div class="outline-text-3" id="text-1-17">
<ul class="org-ul">
<li>The next function is easy.
</li>
<li>We need to print out the current stage.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">displayStage</span>():
    <span style="color: #859900;">print</span>(stages[stageindex])
</pre>
</div>
</div>
</div>
