Yr8/8-CS-TextGames/source/4_Lesson.org
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- The next function is a little more tricky.
- We'll need to do a little experimentation to work out how to complete it.
- Create a new file called =global.py=
- Add in this code
#+begin_src python
foo = 1

def myfunc():
    bar = 2
    print(foo)
    print(bar)
    bar +=1
    foo +=1
    
#+end_src
- Save the file and run it.
- Now switch to the interpreter and try and run the function.
#+begin_src python
  foo = 'I am foo'

  def bar():
      baz = 'I am baz'
      print(baz)
#+end_src
- Save and tun the code, then in the interpreter type
#+begin_src python
print(foo)
bar()
#+end_src
- You should see the two lines printed.
- Let's alter the function to print both =foo= and =baz=
#+begin_src python
    foo = 'I am foo'

    def bar():
        baz = 'I am baz'
        print(foo)
        print(baz)
#+end_src
- Again switch to your interpreter and type
#+begin_src python
bar()
#+end_src
- And again both lines should be printed.
- Now let's try altering the variables =baz= and =foo=
- Try this first.
#+begin_src python
  foo = 'I am foo'

  def bar():
      baz = 'I am baz'
      baz += ', nice to meet you'
      print(foo)
      print(baz)
#+end_src
- Save, run and call the function from the interpreter again.
- Let's try the same change to foo.
#+begin_src python
  foo = 'I am foo'

  def bar():
      baz = 'I am baz'
      baz += ', nice to meet you'
      foo += ', nice to meet you'
      print(foo)
      print(baz)
#+end_src
- Now we get an error. Why?
- Variables that are declared inside a function and those declared outside a function are different.
- We call variables that are declared in the main body of code =Global Variables= and those declared within function are =Local Variables=
- While a function has no problems reading a global variable, it can't alter them. Additionally a function can't even read variables that are local to other functions.
- To allow our function to alter the global variable, we must tell it that the variable foo is global.
#+begin_src python
  foo = 'I am foo'

  def bar():
      global foo
      baz = 'I am baz'
      baz += ', nice to meet you'
      foo += ', nice to meet you'
      print(foo)
      print(baz)
#+end_src
- Try this code out and everything should be awesome.
- NOTE - as you get better at programming, you should try and avoid using global variables as much as possible, as they can lead to unexpected bugs in your code, where multiple functions are relying on or changing their values.
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
- Let's go back to our hangman.py file.
- The next function is going to allow the player to make a guess of a letter.
- It will then increase the =stageindex= if they get it wrong and remove the letter from the alphalist.
- It will increase the =correctGuesses= if they get it right and remove the letter from the alphalist.
- Because we're altering the =stageindex= and =correctGuesses= variables, we'll need to use the =global= keyword.
** Badge It - Gold (Part II)
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
-Create a function called =Guess=
#+begin_src python
def Guess():
#+end_src
- Within the function:
  1. use the =global= keyword to make the =stageindex= and =correctGuesses= variables available to the function.
  2. Set a variable called =guess= to be the input from a player's guess.
  3. Use conditional selection =if,elif,else= to:
     1. Print that the character can't be found if the =guess= is =not in= the =alphalist=
     2. Otherwise, if the =guess= is =not in= the =word=, then increase =stageindex= by one and remove the =guess= from the alphalist.
     3. Otherwise, remove the =guess= from the =alphalist= and =for= each letter in the word, if the letter is equal to the guess, increase =correctLetters= by 1.
- Note - to remove an item from a list you can use code like this.
#+begin_src python
myList.remove(element)
#+end_src
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
- One more function for you to write now.
- We need to check if the game has ended or not.
- So we're going to need access to the =global= =gameOn= variable.
- The basic concept will be:
  1. If the length of the word being guessed is equal to the value of =correctLetters= then we can print out the current stage, and a message that the player has won, and finally change the =gameOn= variable to False.
  2. If the =stageIndex= is equal to 8 (or whatever the final stage you have_, then we should print out the current stage, send a message that the player has lost, and then set =gameOn= to false.
** Badge It - Platinum
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- For your final badge, try and write a function called =checkEnd():= that checks if the game has ended or not.
** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:
- At the very end of your game, you'll need a little bit of code to get the game running.
#+begin_src python
while gameOn == True:
    displayWord()
    displayStage()
    Guess()
    checkEnd()
#+end_src
- Try running your game and see whether it is all working correctly.
