Yr8/8-CS-TextGames/pages/4_Lesson.html
<div id="outline-container-sec-1-18" class="outline-3 code">
<h3 id="sec-1-18">Code It</h3>
<div class="outline-text-3" id="text-1-18">
<ul class="org-ul">
<li>The next function is a little more tricky.
</li>
<li>We'll need to do a little experimentation to work out how to complete it.
</li>
<li>Create a new file called <code>global.py</code>
</li>
<li>Add in this code
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = 1

<span style="color: #859900;">def</span> <span style="color: #b58900;">myfunc</span>():
    <span style="color: #6c71c4;">bar</span> = 2
    <span style="color: #859900;">print</span>(foo)
    <span style="color: #859900;">print</span>(bar)
    <span style="color: #6c71c4;">bar</span> +=1
    <span style="color: #6c71c4;">foo</span> +=1
</pre>
</div>
<ul class="org-ul">
<li>Save the file and run it.
</li>
<li>Now switch to the interpreter and try and run the function.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'I am foo'</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">bar</span>():
    <span style="color: #6c71c4;">baz</span> = <span style="color: #2aa198;">'I am baz'</span>
    <span style="color: #859900;">print</span>(baz)
</pre>
</div>
<ul class="org-ul">
<li>Save and tun the code, then in the interpreter type
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">print</span>(foo)
bar()
</pre>
</div>
<ul class="org-ul">
<li>You should see the two lines printed.
</li>
<li>Let's alter the function to print both <code>foo</code> and <code>baz</code>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'I am foo'</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">bar</span>():
    <span style="color: #6c71c4;">baz</span> = <span style="color: #2aa198;">'I am baz'</span>
    <span style="color: #859900;">print</span>(foo)
    <span style="color: #859900;">print</span>(baz)
</pre>
</div>
<ul class="org-ul">
<li>Again switch to your interpreter and type
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">bar()
</pre>
</div>
<ul class="org-ul">
<li>And again both lines should be printed.
</li>
<li>Now let's try altering the variables <code>baz</code> and <code>foo</code>
</li>
<li>Try this first.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'I am foo'</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">bar</span>():
    <span style="color: #6c71c4;">baz</span> = <span style="color: #2aa198;">'I am baz'</span>
    <span style="color: #6c71c4;">baz</span> += <span style="color: #2aa198;">', nice to meet you'</span>
    <span style="color: #859900;">print</span>(foo)
    <span style="color: #859900;">print</span>(baz)
</pre>
</div>
<ul class="org-ul">
<li>Save, run and call the function from the interpreter again.
</li>
<li>Let's try the same change to foo.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'I am foo'</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">bar</span>():
    <span style="color: #6c71c4;">baz</span> = <span style="color: #2aa198;">'I am baz'</span>
    <span style="color: #6c71c4;">baz</span> += <span style="color: #2aa198;">', nice to meet you'</span>
    <span style="color: #6c71c4;">foo</span> += <span style="color: #2aa198;">', nice to meet you'</span>
    <span style="color: #859900;">print</span>(foo)
    <span style="color: #859900;">print</span>(baz)
</pre>
</div>
<ul class="org-ul">
<li>Now we get an error. Why?
</li>
<li>Variables that are declared inside a function and those declared outside a function are different.
</li>
<li>We call variables that are declared in the main body of code <code>Global Variables</code> and those declared within function are <code>Local Variables</code>
</li>
<li>While a function has no problems reading a global variable, it can't alter them. Additionally a function can't even read variables that are local to other functions.
</li>
<li>To allow our function to alter the global variable, we must tell it that the variable foo is global.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'I am foo'</span>

<span style="color: #859900;">def</span> <span style="color: #b58900;">bar</span>():
    <span style="color: #859900;">global</span> foo
    <span style="color: #6c71c4;">baz</span> = <span style="color: #2aa198;">'I am baz'</span>
    <span style="color: #6c71c4;">baz</span> += <span style="color: #2aa198;">', nice to meet you'</span>
    <span style="color: #6c71c4;">foo</span> += <span style="color: #2aa198;">', nice to meet you'</span>
    <span style="color: #859900;">print</span>(foo)
    <span style="color: #859900;">print</span>(baz)
</pre>
</div>
<ul class="org-ul">
<li>Try this code out and everything should be awesome.
</li>
<li>NOTE - as you get better at programming, you should try and avoid using global variables as much as possible, as they can lead to unexpected bugs in your code, where multiple functions are relying on or changing their values.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-19" class="outline-3 learn">
<h3 id="sec-1-19">Learn It</h3>
<div class="outline-text-3" id="text-1-19">
<ul class="org-ul">
<li>Let's go back to our hangman.py file.
</li>
<li>The next function is going to allow the player to make a guess of a letter.
</li>
<li>It will then increase the <code>stageindex</code> if they get it wrong and remove the letter from the alphalist.
</li>
<li>It will increase the <code>correctGuesses</code> if they get it right and remove the letter from the alphalist.
</li>
<li>Because we're altering the <code>stageindex</code> and <code>correctGuesses</code> variables, we'll need to use the <code>global</code> keyword.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-20" class="outline-3 badge">
<h3 id="sec-1-20">Badge It - Gold (Part II)</h3>
<div class="outline-text-3" id="text-1-20">
<p>
-Create a function called <code>Guess</code>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">def</span> <span style="color: #b58900;">Guess</span>():
</pre>
</div>
<ul class="org-ul">
<li>Within the function:
<ol class="org-ol">
<li>use the <code>global</code> keyword to make the <code>stageindex</code> and <code>correctGuesses</code> variables available to the function.
</li>
<li>Set a variable called <code>guess</code> to be the input from a player's guess.
</li>
<li>Use conditional selection <code>if,elif,else</code> to:
<ol class="org-ol">
<li>Print that the character can't be found if the <code>guess</code> is <code>not in</code> the <code>alphalist</code>
</li>
<li>Otherwise, if the <code>guess</code> is <code>not in</code> the <code>word</code>, then increase <code>stageindex</code> by one and remove the <code>guess</code> from the alphalist.
</li>
<li>Otherwise, remove the <code>guess</code> from the <code>alphalist</code> and increase the <code>correctGuesses</code> by 1.
</li>
</ol>
</li>
</ol>
</li>
<li>Note - to remove an item from a list you can use code like this.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">myList.remove(element)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-21" class="outline-3 learn">
<h3 id="sec-1-21">Learn It</h3>
<div class="outline-text-3" id="text-1-21">
<ul class="org-ul">
<li>One more function for you to write now.
</li>
<li>We need to check if the game has ended or not.
</li>
<li>So we're going to need access to the <code>global</code> <code>gameOn</code> variable.
</li>
<li>The basic concept will be:
<ol class="org-ol">
<li>If the length of the word being guessed is equal to the value of <code>correctGuesses</code> then we can print out the current stage, and a message that the player has won, and finally change the <code>gameOn</code> variable to False.
</li>
<li>If the <code>stageIndex</code> is equal to 8 (or whatever the final stage you have_, then we should print out the current stage, send a message that the player has lost, and then set <code>gameOn</code> to false.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-22" class="outline-3 badge">
<h3 id="sec-1-22">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-1-22">
<ul class="org-ul">
<li>For your final badge, try and write a function called <code>checkEnd():</code> that checks if the game has ended or not.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-23" class="outline-3 try">
<h3 id="sec-1-23">Try It</h3>
<div class="outline-text-3" id="text-1-23">
<ul class="org-ul">
<li>At the very end of your game, you'll need a little bit of code to get the game running.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">while</span> gameOn == <span style="color: #268bd2;">True</span>:
    displayWord()
    displayStage()
    Guess()
    checkEnd()
</pre>
</div>
<ul class="org-ul">
<li>Try running your game and see whether it is all working correctly.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
